app/Controllers/ClientesT.php

INSERT INTO `cliente` (`Nombre_Cliente`, `Apellido_Cliente`, `Dni_Cliente`, `Telefono_Cliente`, `Correo_Cliente`, `Contraseña_Cliente`, `Direccion_Cliente`, `Estado_Cliente`) VALUES ('Id minim nesciunt s', 'Sit est est illum m', 'Commodi animi autem', 'Ut aut in quia labor', 'jera@mailinator.com', '$2y$10$YXC5.pBQBqezVPPGm8LE/OkPXan0vCmcxC75oDf8v/3FDTbCf2F4K', 'Veniam harum laboru', '2')
---
    public function Registrar()
    {
        try {
            $validation = new ClientValidator();
            $data = $this->request->getPost();
            $isValid = $validation->validate($data);

            if (!$isValid) {
                $errors = Services::validation()->getErrors();
                return json_encode($errors, JSON_UNESCAPED_UNICODE);
            }

            $data = [
                'ID_Cliente' => $this->request->getPost('idCliente'),
                'Nombre_Cliente' => $this->request->getPost('txtNombre'),
                'Apellido_Cliente' => $this->request->getPost('txtApellido'),
                'Dni_Cliente' => $this->request->getPost('txtIdentificacion'),
                'Telefono_Cliente' => $this->request->getPost('txtTelefono'),
                'Correo_Cliente' => $this->request->getPost('txtEmail'),
                'Contraseña_Cliente' => password_hash( $this->request->getPost('txtPassword'), PASSWORD_DEFAULT),
                'Direccion_Cliente' => $this->request->getPost('txtDireccion'),
                'Estado_Cliente' => $this->request->getPost('listEstado')
            ];

            $store = $this->ClientesTModel->insert($data);