app/Controllers/Compras.php


            if (empty($id)) {
                try {
                    $this->ComprasModel->insert($data);
---
INSERT INTO `compra` (`ID_Usuario`, `Fecha_Compra`, `IGV_Compra`, `Estado_Compra`, `Total_Compra`, `SubTotal_Compra`) VALUES ('23', '2023-05-30', '0.18', '1', '1416.00', '1200.00')