app/Models/ClientesTModel.php

    public function getClientexEmail($email)
    {
        $this->builder->select('*');
        $this->builder->where('Correo_Cliente', $email);
        $query = $this->builder->get(); //traemos los datos de la tabla rol y lo almacenamos en la var. query
---
SELECT *
FROM `cliente`
WHERE `Correo_Cliente` = 'jera@mailinator.com'