app/Models/ClientesModel.php

    public function listarClientes()
    {
        $this->builder->select('*');
        $this->builder->orderBy('ID_Cliente', 'desc');
        $query = $this->builder->get(); //traemos los datos de la tabla rol y lo almacenamos en la var. query
---
SELECT *
FROM `cliente`
ORDER BY `ID_Cliente` DESC

    public function verificar_inicio_sesion($user, $password)
    {
        $this->builder->select('*');
        $this->builder->where('Correo_Cliente', $user);
        $query = $this->builder->get();
        $this->db->close();
        if ($this->builder->countAllResults() > 0) {
---
SELECT *
FROM `cliente`
WHERE `Correo_Cliente` = 'gera@gmail.com'
SELECT COUNT(*) AS `numrows`
FROM `cliente`