app/Models/ProductosModel.php

    public function listarProductos(){
        $this->builder->select('*');
        $this->builder->join('categoria_producto as cp', 'producto.ID_Categoria=cp.ID_Categoria');
        $this->builder->orderBy('ID_Producto','desc');
        $query = $this->builder->get();
---
SELECT *
FROM `producto`
JOIN `categoria_producto` as `cp` ON `producto`.`ID_Categoria`=`cp`.`ID_Categoria`
ORDER BY `ID_Producto` DESC

    public function getProductos($id)
    {
        $this->builder->select('*');
        $this->builder->where('ID_Producto',$id);
        $query = $this->builder->get();
---
SELECT *
FROM `producto`
WHERE `ID_Producto` = ''

    public function getlistarProductos(){
        $this->builder->select('*');
        $query = $this->builder->get();
---
SELECT *
FROM `producto`