app/Models/ProveedorModel.php

    public function listarProveedores(){
        $this->builder->select('*');
        $this->builder->orderBy('ID_Proveedor','desc');
        $query = $this->builder->get();
---
SELECT *
FROM `proveedor`
ORDER BY `ID_Proveedor` DESC

    public function getProveedor($id)
    {
        $this->builder->select('*');
        $this->builder->where('ID_Proveedor',$id);
        $query = $this->builder->get();
---
SELECT *
FROM `proveedor`
WHERE `ID_Proveedor` = '1'