app/Models/UsuariosModel.php

    public function listarUsuarios()
    {
        $this->builder->select('*');
        $this->builder->join('rol as r', 'usuario.ID_Rol=r.ID_Rol');
        $this->builder->orderBy('ID_Usuario', 'desc');
        $query = $this->builder->get(); //traemos los datos de la tabla rol y lo almacenamos en la var. query
---
SELECT *
FROM `usuario`
JOIN `rol` as `r` ON `usuario`.`ID_Rol`=`r`.`ID_Rol`
ORDER BY `ID_Usuario` DESC